In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv("D:\Study\Data Science\Python\ineuron\Data_Set\Student_dataset\stud_clean.csv")
data.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [3]:
#taking a copy of data into data1 on which all operations will be peformed
data1= data.copy()
data1.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [4]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## 1 Encoding of Categorical Values done Manually using Python

### 1.1 Label Encoding of 'Gender' Feature done manually
 1. Female assign value of 0
 2. Male assign value of 1
 3. Then datatype fo Gender feature changed from object to Numeric

In [5]:
data1['gender'] = data1['gender'].replace('female', '0')
data1['gender'] = data1['gender'].replace('male', '1')
data1['gender']= data1['gender'].astype('int64')

### 1.2. Label Encoding of 'parental level of education'  Feature'  done manually
 1. Replace 'high school' by  '0'
 2. Replace 'some high school' by  '1'
 3. Replace 'some college' by  '2'
 4. Replace "bachelor's degree" by  '3'
 5. Replace "associate's degree" by  '4'
 6. Replace "master's degree" by '5'
 7. Then change datatype of 'parental level of education' feature to Numeric

In [6]:
# Different values in parental level of education
data1['parental level of education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [7]:
data1['parental level of education'] = data1['parental level of education'].replace('high school', '0')
data1['parental level of education'] = data1['parental level of education'].replace('some high school', '1')
data1['parental level of education'] = data1['parental level of education'].replace('some college', '2')
data1['parental level of education'] = data1['parental level of education'].replace("bachelor's degree", '3')
data1['parental level of education'] = data1['parental level of education'].replace("associate's degree", '4')
data1['parental level of education'] = data1['parental level of education'].replace("master's degree", '5')
data1['parental level of education'] = data1['parental level of education'].apply(pd.to_numeric)

### 1.3. Label Encoding of 'race/ethicity'  Feature'  done manually
 1. Replace 'group A' by  '0'
 2. Replace 'group B' by  '1'
 3. Replace 'group C' by  '2'
 4. Replace "group D" by  '3'
 5. Replace "group E" by  '4'
 6. Then change datatype fo race/ethicity feature changed from object to Numeric

In [8]:
# Different values in race/ethnicity 
data1['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [9]:
data1['race/ethnicity'] = data1['race/ethnicity'].replace('group A', '0')
data1['race/ethnicity'] = data1['race/ethnicity'].replace('group B', '1')
data1['race/ethnicity'] = data1['race/ethnicity'].replace('group C', '2')
data1['race/ethnicity'] = data1['race/ethnicity'].replace('group D', '3')
data1['race/ethnicity'] = data1['race/ethnicity'].replace('group E', '4')
data1['race/ethnicity'] = data1['race/ethnicity'].apply(pd.to_numeric)

### 1.4. Label Encoding of 'lunch'  Feature'  done manually
 1. Replace 'standard' by  '0'
 2. Replace 'free/reduced' by  '1'
 3. Then change datatype fo lunch feature changed from object to Numeric

In [10]:
# Different values in lunch
data1['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

In [11]:
data1['lunch'] = data1['lunch'].replace('standard', '0')
data1['lunch'] = data1['lunch'].replace('free/reduced', '1')
data1['lunch'] = data1['lunch'].apply(pd.to_numeric)

### 1.5. Label Encoding of 'test preparation course'  Feature'  done manually
 1. Replace 'none' by  '0'
 2. Replace 'completed' by  '1'
 3. Then change datatype fo lunch feature changed from object to Numeric

In [12]:
# Different values in test preparation course
data1['test preparation course'].unique()

array(['none', 'completed'], dtype=object)

In [13]:
data1['test preparation course'] = data1['test preparation course'].replace('none', '0')
data1['test preparation course'] = data1['test preparation course'].replace('completed', '1')
data1['test preparation course'] = data1['test preparation course'].apply(pd.to_numeric)

### 1.6 Checking data type and values of dataset after manual Encoding

In [14]:
data1.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,1,3,0,0,72,72,74
1,0,2,2,0,1,69,90,88
2,0,1,5,0,0,90,95,93
3,1,0,4,1,0,47,57,44
4,1,2,2,0,0,76,78,75

In [15]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   int64
 1   race/ethnicity               1000 non-null   int64
 2   parental level of education  1000 non-null   int64
 3   lunch                        1000 non-null   int64
 4   test preparation course      1000 non-null   int64
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(8)
memory usage: 62.6 KB

### 1.7 Remarks
1.  All categorical values are changed to numerical
2.  There is no Non Value in the dataset

## 2 Encoding of Categorical Values done using label Encoder  Function

### 2.1 Copying dataset into data2

In [34]:
data2 = data.copy()
data2.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

### 2.2 Using sklearn library to Label Encode Categorical Features

In [38]:
from sklearn.preprocessing import LabelEncoder
# creating instance of labelencoder
labelencoder = LabelEncoder()

# Assigning numerical values using Label encoder
data2['gender'] = labelencoder.fit_transform(data2['gender'])
data2['race/ethnicity'] = labelencoder.fit_transform(data2['race/ethnicity'])
data2['parental level of education'] = labelencoder.fit_transform(data2['parental level of education'])
data2['lunch'] = labelencoder.fit_transform(data2['lunch'])
data2['test preparation course'] = labelencoder.fit_transform(data2['test preparation course'])

### 2.3 Checking data type and values of dataset after manual Encoding

In [37]:
data2.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,1,1,1,1,72,72,74
1,0,2,4,1,0,69,90,88

In [36]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   int32
 1   race/ethnicity               1000 non-null   int32
 2   parental level of education  1000 non-null   int32
 3   lunch                        1000 non-null   int32
 4   test preparation course      1000 non-null   int32
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int32(5), int64(3)
memory usage: 43.1 KB

### 2.4 Remarks
1.  All categorical values are changed to numerical
2.  There is no Non Value in the dataset

## 3 Encoding of Categorical Values  using One Hot Encoder  Function

In [63]:
# Create a new datframe data4 
data4 = data.copy()
data4.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [66]:
# Seggregate Numeric and Categorical Features

num_features =data4.select_dtypes(exclude="object").columns
cat_features = data4.select_dtypes(include="object").columns

In [67]:
#import necessary library
from sklearn.preprocessing import OneHotEncoder

#creating instance of one-hot-encoder
encoder = OneHotEncoder(handle_unknown='ignore')

#perform one-hot encoding on 'categirical' features
encoder_df = pd.DataFrame(encoder.fit_transform(data4[cat_features]).toarray())

#merge one-hot encoded columns  with numerical features
final_df =encoder_df.join(data4[num_features])

#view final df
final_df.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,math score,reading score,writing score
0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,72,72,74
1,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,1.0,0.0,69,90,88

### 3.1 Remarks
1.  All categorical values are encoded and Tarnsformed using One hot Encoding

## 4 Scaling of Numerical Values using One StandardScaler  Function

In [73]:
#import necessary library
from sklearn.preprocessing import StandardScaler

#creating instance of Standard Scaler
numeric_scale = StandardScaler()

#scaling numerical features
scaler_df= pd.DataFrame(numeric_scale.fit_transform(data4[num_features]), columns=('math score','reading score','writing score'))
scaler_df.head(2)

   math score  reading score  writing score
0    0.381044       0.180350       0.385487
1    0.174067       1.451912       1.333961

In [75]:
#merge one-hot encoded columns of Categorical featurs with scaled columns of numerical features
final_df =encoder_df.join(scaler_df)

#view final df
final_df.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,math score,reading score,writing score
0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.381044,0.180350,0.385487
1,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,1.0,0.0,0.174067,1.451912,1.333961

### 4.1 Remarks
1.  All categorical values are changed to numerical
2.  Numerical features are now scaled down